Autodesk.Revit.DB.IFCExportElement
An enumerated type defining if an element is exported to IFC or not.

Autodesk.Revit.DB.IFCExportElement.No
Don't export element to IFC regardless of type or category settings.

Autodesk.Revit.DB.IFCExportElement.Yes
Export element to IFC regardless of type or category settings.

Autodesk.Revit.DB.IFCExportElement.ByType
Export element to IFC according to type settings.